## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 82 to add, 43 to change, 4 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_application.app
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-AWS-Migration&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-AWS-Migration&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-Prod&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_subscription.this
* Replace
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["SDS-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
        name                       = "SDS-Prod"
      ~ subscription_ids           = [
          + "4bb049c8-33f3-4860-91b4-9ee45375cc18",
          + "58a2ce36-4e09-467b-8330-d164aa559c68",
          + "5ca62022-6aa2-4cee-aaa7-e7536c8d566c",
          + "74dacd4f-a248-45bb-a2f0-af700dc4cf68",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:dcd-aws-migration)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-aws-migration) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-aws-migration)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-aws-migration) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-aws-migration)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"

          + implicit_grant {
              + access_token_issuance_enabled = false
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["DCD-AWS-Migration"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS AKS Administrators (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS AKS Users (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Contributors (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Owners (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Readers (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the DCD-AWS-Migration subscription"
      + display_name                   = "DTS Blob Readers (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Contributor-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "1a4bada3-4107-47e4-a5d7-aa66a580369a"
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Contributor-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "1a4bada3-4107-47e4-a5d7-aa66a580369a"
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group_member.members["Reader-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
    }

  # module.subscription["DCD-AWS-Migration"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles               

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...



  # module.subscription["DTS-SHAREDSERVICES-PROD"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      ~ allow_nested_items_to_be_public   = true -> false
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c5ca62022e7536c8d566csa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c5ca62022e7536c8d566csa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (33 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/DTS-SHAREDSERVICES-PROD"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_application.acme_appreg[0] will be updated in-place
  ~ resource "azuread_application" "acme_appreg" {
        id                             = "93783920-c57e-489a-bcef-7f2b960a98f1"
      ~ oauth2_permission_scope_ids    = {} -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access acme-dts-sharedservices-stg on behalf of the signed-in user."
              + admin_consent_display_name = "Access acme-dts-sharedservices-stg"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access acme-dts-sharedservices-stg on your behalf."
              + user_consent_display_name  = "Access acme-dts-sharedservices-stg"
              + value                      = "user_impersonation"
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9811e238-e068-4802-a13c-f67a5945f03f"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "43814574-d3c0-32ba-2097-73b4304e2004"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-sharedservices-stg) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dts-sharedservices-stg)" -> null
              - enabled                    = true -> null
              - id                         = "43814574-d3c0-32ba-2097-73b4304e2004" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-sharedservices-stg) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dts-sharedservices-stg)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-sharedservices-stg) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dts-sharedservices-stg)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-sharedservices-stg) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dts-sharedservices-stg)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          + homepage_url  = "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

          ~ implicit_grant {
              ~ id_token_issuance_enabled     = false -> true
                # (1 unchanged attribute hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "9811e238-e068-4802-a13c-f67a5945f03f"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG AKS Administrators" -> "Grants aks cluster admin permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "da4f46da-290b-4d6c-bd32-d863d0e3cd78"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG AKS Users" -> "Grants aks cluster user permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "2dfec87a-b361-45e1-bbf4-c8813c7fac42"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG Subscription Contributors" -> "Grants contributor permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "99475935-ae5a-4434-9713-650fe3252fb0"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Key Vault Administrator"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG Subscription Key Vault Administrators" -> "Grants key vault administrator permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "052883f8-1d69-4e2d-8394-0cbafcf93ea6"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG Subscription Owners" -> "Grants owner permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "40cbf43e-0436-4cde-847b-0f9835ed8e1f"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG Subscription Readers" -> "Grants reader permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "55fe4c96-2ed9-443a-b6e7-03d2cb20f790"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DTS-SHAREDSERVICES-STG subscription"
      + display_name                   = "DTS Security Readers (sub:dts-sharedservices-stg)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-SHAREDSERVICES-STG Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DTS-SHAREDSERVICES-STG subscription"
        id                         = "ed8d4784-3767-4f4f-a16e-b6e4b65e7eed"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "99475935-ae5a-4434-9713-650fe3252fb0"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "052883f8-1d69-4e2d-8394-0cbafcf93ea6/member/881cece9-ee47-4c97-ab61-39bbe100893e" -> (known after apply)
      ~ member_object_id = "881cece9-ee47-4c97-ab61-39bbe100893e" -> "63469462-b784-42e8-8a66-20a8840ac84a" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuread_group_member.members["Key Vault Administrator-1"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "052883f8-1d69-4e2d-8394-0cbafcf93ea6/member/63469462-b784-42e8-8a66-20a8840ac84a" -> (known after apply)
      ~ member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a" -> "881cece9-ee47-4c97-ab61-39bbe100893e" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "f07f6e0b-edd1-482f-9b41-2a0f27aca29e"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "080fee6d-5260-463e-91b0-3e9c41025263"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/c74dacd4faf700dc4cf68kv"
        name                            = "c74dacd4faf700dc4cf68kv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://c74dacd4faf700dc4cf68kv.vault.azure.net/secrets/sp-token/3352d7d082c241239b99d8c7d32586d8"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      ~ allow_nested_items_to_be_public   = true -> false
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/c74dacd4faf700dc4cf68sa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c74dacd4faf700dc4cf68sa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (33 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/DTS-SHAREDSERVICES-STG"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 82 to add, 43 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->